In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.4.2'

Pandas Series

In [5]:
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
s1.values

array([1, 2, 3, 4, 5], dtype=int64)

In [9]:
s2 = pd.Series([1,2,3,4,5], index = [10,20,30,40,50])
s2

10    1
20    2
30    3
40    4
50    5
dtype: int64

In [11]:
s2 = pd.Series([1,2,3,4,5], index = ['a', 'b','c','d','e'])
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [17]:
#dictionary to pds
age = {'Bob':45, 'Jenny':89, 'Alex': 67}
age1 = pd.Series(age)
age1

Bob      45
Jenny    89
Alex     67
dtype: int64

Pandas DataFrame

In [20]:
df1 = pd.DataFrame()
type(df1)
print(df1)

Empty DataFrame
Columns: []
Index: []

In [21]:
employee = [['Alex', 'Manager', 9000], ['Sarah', 'Recruiter', 8999], ['Martin', 'Developer', 500000]]

In [23]:
emp_df = pd.DataFrame(employee)
emp_df

        0          1       2
0    Alex    Manager    9000
1   Sarah  Recruiter    8999
2  Martin  Developer  500000

In [25]:
emp_df = pd.DataFrame(employee, columns = ['Name', 'Role', 'Salary'] , index= [1001, 1002,1003])
emp_df

        Name       Role  Salary
1001    Alex    Manager    9000
1002   Sarah  Recruiter    8999
1003  Martin  Developer  500000

In [27]:
emp_dict = {'Name': ['Alex', 'Bob', 'Martin'],
             'Salary': [9000, 8999, 10000],
            'Role': ['Manager', 'Recruiter', 'Developer']
           }
emp_dict1 = pd.DataFrame(emp_dict)
emp_dict1

     Name  Salary       Role
0    Alex    9000    Manager
1     Bob    8999  Recruiter
2  Martin   10000  Developer

In [29]:
emp_dict1.head(2)

   Name  Salary       Role
0  Alex    9000    Manager
1   Bob    8999  Recruiter

In [30]:
emp_dict1.tail(2)

     Name  Salary       Role
1     Bob    8999  Recruiter
2  Martin   10000  Developer

In [37]:
import pandas as pd
df = pd.DataFrame({
 'Name': ['Abbas','Rohit','Micky'],
 'Birthyear': [1976, 1984, 2013]
})
df['age'] = df['Birthyear'].apply(lambda x: (2022-x)+5)
df.head(2)

    Name  Birthyear  age
0  Abbas       1976   51
1  Rohit       1984   43

In [39]:
import pandas as pd
lst1 = ['Python', 'Java']
lst2 = [95, 80]
df = pd.DataFrame((lst1, lst2), columns=['Name', 'Age'])
df.head()

     Name   Age
0  Python  Java
1      95    80